In [115]:
import pandas as pd
import plotly.express as px
from sklearn.decomposition import PCA
import re

In [42]:
cust_data = pd.read_csv('twm_customer.csv', sep=';')
check_data = pd.read_csv('twm_checking_acct.csv', sep=';')
saving_data = pd.read_csv('twm_savings_acct.csv', sep=';')
credit_data = pd.read_csv('twm_credit_acct.csv', sep=';')
trans_data = pd.read_csv('twm_transactions.csv', sep=';')
acc_data = pd.read_csv('twm_accounts.csv', sep=';')
checktrans_data = pd.read_csv('twm_checking_tran.csv', sep=';')

In [19]:
cust_data
#cluster by income using: age, gender, martial_status, state_code

,cust_id,income,age,years_with_bank,nbr_children,gender,marital_status,name_prefix,first_name,last_name,street_nbr,street_name,postal_code,city_name,state_code
0,1362691,26150,46,5,1,M,2,,Donald ...,Marek ...,8298,Second ...,89194,Las Vegas,NV
1,1362487,6605,71,1,0,M,2,,ChingDyi ...,Moussavi ...,10603,Daffodil ...,90159,Los Angeles,CA
2,1363160,18548,38,8,0,F,1,,Rosa ...,Johnston ...,8817,Figueroa ...,90024,Los Angeles,CA
3,1362752,47668,54,3,0,F,1,,Lisa ...,Martin ...,676,Humble ...,90172,Los Angeles,CA
4,1362548,44554,59,9,2,F,4,,Barbara ...,O'Malley ...,6578,C ...,10138,New York City,NY
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
742,1363324,14795,36,6,1,F,4,,Lillian ...,Kaufman ...,9677,B ...,90016,Los Angeles,CA
743,1362895,26387,56,6,1,M,2,,Marty ...,McSherry ...,3227,Inspiration ...,10126,New York City,NY
744,1362569,61300,50,0,2,M,2,,Ken ...,Lawrence ...,6082,23rd ...,87194,Albuquerque,NM
745,1363364,15100,37,7,0,F,2,,Debbie ...,Runner ...,7851,H ...,35241,Birmingham,AL
746,1363303,17875,18,3,0,F,1,,Molly ...,Potter ...,7824,E ...,90029,Los Angeles,CA

In [81]:
cust1 = cust_data[['income', 'age', 'gender', 'marital_status', 'state_code']]

In [100]:
def gender(x):
    if x == 'M ':
        return 1
    else:
        return 0
cust1['gender_code'] = pd.Series.apply(cust1['gender'],gender)

<ipython-input-100-bc4c3828734f>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cust1['gender_code'] = pd.Series.apply(cust1['gender'],gender)

In [107]:
cust1 = cust1.drop(columns='gender')

In [134]:
sc = cust1['state_code'].sort_values().unique()
sc

array(['AL', 'AZ', 'CA', 'CO', 'DC', 'FL', 'GA', 'HI', 'IL', 'IN', 'KS',
       'KY', 'LA', 'MA', 'MD', 'MI', 'MN', 'MO', 'NB', 'NC', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'TN', 'TX', 'VA', 'WA', 'WI'],
      dtype=object)

In [131]:
def regex(line):
    updated_string = re.sub("\s.", "", line)
    return updated_string
cust1['state_code'] = pd.Series.apply(cust1['state_code'],regex)

In [137]:
cust1.replace({"state_code": {'AL':0,
                             'AZ':1,
                             'CA':2,
                             'CO':3,
                             'DC':4,
                             'FL':5,
                             'GA':6,
                             'HI':7,
                             'IL':8,
                             'IN':9,
                             'KS':10,
                             'KY':11,
                             'LA':12,
                             'MA':13,
                             'MD':14,
                             'MI':15,
                             'MN':16,
                             'MO':17,
                             'NB':18,
                             'NC':19,
                             'NJ':20,
                             'NM':21,
                             'NV':22,
                             'NY':23,
                             'OH':24,
                             'OK':25,
                             'OR':26,
                             'PA':27,
                             'TN':28,
                             'TX':29,
                             'VA':30,
                             'WA':31,
                             'WI':32}}, inplace=True)

In [143]:
#cleaned and prepped data
cust1

     income  age  marital_status  state_code  gender_code
0     26150   46               2          22            1
1      6605   71               2           2            1
2     18548   38               1           2            0
3     47668   54               1           2            0
4     44554   59               4          23            0
..      ...  ...             ...         ...          ...
742   14795   36               4           2            0
743   26387   56               2          23            1
744   61300   50               2          21            1
745   15100   37               2           0            0
746   17875   18               1           2            0

[747 rows x 5 columns]